#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/Terraform-User-0054/gh-actions-demo/runs/run-mqtptErAuDCbXUcQ

Waiting for the plan to start...

Terraform v0.13.5
Configuring remote state backend...
Initializing Terraform configuration...
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

google_storage_bucket.git-test-vasu-bucket: Refreshing state... [id=api-test-bucket-git]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_storage_bucket.git-test-vasu-bucket must be replaced
-/+ resource "google_storage_bucket" "git-test-vasu-bucket" {
      ~ bucket_policy_only = false -> (known after apply)
        force_destroy      = false
      ~ id                 = "api-test-bucket-git" -> (known after apply)
      - labels             = {} -> null
        location           = "US-EAST1"
      ~ name               = "api-test-bucket-git" -> "api-test-bucket-git-testing" # forces replacement
        project            = "vasu-pratice1-terraform-admin"
      - requester_pays     = false -> null
      ~ self_link          = "https://www.googleapis.com/storage/v1/b/api-test-bucket-git" -> (known after apply)
        storage_class      = "REGIONAL"
      ~ url                = "gs://api-test-bucket-git" -> (known after apply)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```

</details>

*Pusher: @gituser963, Action: `pull_request`*